Merge pull request #3 from monnss69/db-connect
Added diagram, db doc must be updated!
